tutorials/airToWaterShockTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 0)        	// 0
    (10 0 0)         	// 1
    (10 0.1 0)      	// 2
    (0  0.1 0)	    	// 3
    (0  0 0.1)	    	// 4 (extruded for 2D case)
    (10 0 0.1)	    	// 5
    (10 0.1 0.1)		// 6
    (0  0.1 0.1)		// 7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (500 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    emptyPlanes
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
