tutorials/airToWaterShockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


regions
(
    boxToCell
    {
        box (5 0 0) (10 0.1 0.1);
        fieldValues
        (
            volScalarFieldValue p   	1e5
            volScalarFieldValue alpha	1e-7
        );
    }
);


// ************************************************************************* //
